app/workers/convert_worker.rb

SELECT  "urlreports".* FROM "urlreports" WHERE "urlreports"."date" = $1 ORDER BY "urlreports"."id" ASC LIMIT $2  [["date", "2019-01-23"], ["LIMIT", 1]]
INSERT INTO "urlreports" ("count", "date") VALUES ($1, $2) RETURNING "id"  [["count", 1], ["date", "2019-01-24"]]
UPDATE "urlreports" SET "count" = $1 WHERE "urlreports"."id" = $2  [["count", 2], ["id", 1]]
---
  def perform(*args)
  	@urlreport = Urlreport.where(date: Date.today).first
  	if @urlreport == nil
  		@urlreport = Urlreport.new()
  		@urlreport.date = Date.today
  		@urlreport.count = 1
  		@urlreport.save
  	else
  		@urlreport.update(count: @urlreport.count+=1)