app/workers/convert_worker.rb

SELECT COUNT(*) FROM "urls" WHERE "urls"."created_at" BETWEEN $1 AND $2  [["created_at", "2019-01-22 00:00:00"], ["created_at", "2019-01-22 23:59:59.999999"]]
---
  def perform(*args)
  	puts Url.where(created_at: Time.zone.now.beginning_of_day..Time.zone.now.end_of_day).count