app/controllers/urlreports_controller.rb

SELECT "urlreports".* FROM "urlreports" ORDER BY id DESC
---
	def index
    	@urlreport = Urlreport.all.order("id ASC")