app/controllers/urls_controller.rb

  def create_shorturl
    respond_to do |format|
      format.json{
        url = Url.find_long(params[:longurl])
        if url!=nil
          render json: { 'status' => 'already_exist', 'shorturl' => url.shorturl }
        else
          url = Url.create_short_url(url_params)
          if url!=nil
            render json: { 'status' => 'new_created', 'shorturl' => url.shorturl }
          else
            render json: { 'status' => 'error_occured' }
          end
        end
      }
      format.html{
        @url = Url.find_long(params[:url][:longurl])
        if @url!=nil
          redirect_to @url
        else
          @url = Url.create_short_url(url_params)
---
SELECT  "urls".* FROM "urls" WHERE "urls"."longurl" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["longurl", "www.test.com"], ["LIMIT", 1]]
INSERT INTO "urls" ("longurl", "shorturl", "domain", "mdsum", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["longurl", "www.gmail.com"], ["shorturl", "www.nav.com/PwKA"], ["domain", "gmail"], ["mdsum", 1290], ["created_at", "2019-01-22 08:45:34.777821"], ["updated_at", "2019-01-22 08:45:34.777821"]]
SELECT  "urls".* FROM "urls" WHERE "urls"."longurl" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["longurl", "https://www.facebook.com/pg/AMS.IIITA/posts/?ref=notif"], ["LIMIT", 1]]
INSERT INTO "urls" ("longurl", "shorturl", "domain", "mdsum", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["longurl", "www.test.com"], ["shorturl", "www.nav.com/JoKA"], ["domain", "test.com"], ["mdsum", 1216], ["created_at", "2019-01-23 09:19:57.517150"], ["updated_at", "2019-01-23 09:19:57.517150"]]

  def show
    if(session[:authenticate] == true)
      @url = Url.find(params[:id])
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

    def search_longurl
      respond_to do |format|
        format.json{
          if(params[:shorturl][0..6]!="http://")
            url = Url.find_suffix(params[:shorturl])
          else
            url = Url.find_short(params[:shorturl])
          end
          if url!=nil
            render json: { 'status' => 'ok', 'longurl' => url.longurl }
          else
            render json: { 'status' => 'invalid_shorturl' }
          end
        }
        format.html{
          if(params[:url][:shorturl][0..6]!="http://")
            @url = Url.find_suffix(params[:url][:shorturl])
          else
            @url = Url.find_short(params[:url][:shorturl])
---
SELECT  "urls".* FROM "urls" WHERE "urls"."suffix" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["suffix", "CigE"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."shorturl" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["shorturl", "www.EFKB/BS%I"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."suffix" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["suffix", "kXVC"], ["LIMIT", 1]]