app/controllers/urls_controller.rb

  def create_shorturl
    respond_to do |format|
      format.json{
        url = Url.find_long(params[:longurl])
        if url!=nil
          render json: { 'message' => 'longurl already exist', 'shorturl' => url.shorturl }
        else
          url = Url.create_short_url(url_params)
---
SELECT  "urls".* FROM "urls" WHERE "urls"."longurl" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["longurl", "www.facebook.com/sellers"], ["LIMIT", 1]]
INSERT INTO "urls" ("longurl", "shorturl", "domain", "suffix") VALUES ($1, $2, $3, $4) RETURNING "id"  [["longurl", "www.facebook.com/sellers"], ["shorturl", "www.vPLB/0eXC"], ["domain", "facebook.com"], ["suffix", "0eXC"]]

  def show
    if(session[:authenticate] == true)
      @url = Url.find(params[:id])
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]