app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "saurabh"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "naveen1234"], ["email", "naveen1234@gmail.com"], ["password", "o110cw325gf527p2686447876"], ["created_at", "2019-01-21 09:47:59.997551"], ["updated_at", "2019-01-21 09:47:59.997551"]]
---
  def signup
    flash[:notice] = ""
    if (User.where(email: params[:user][:email]).first)
      flash[:notice] = "User Already Exist"
      render 'new'
    elsif(User.where(username: params[:user][:username]).first)
      flash[:notice] = "Username Already Exist"
      render 'new'
    else
      @user = User.create_user(user_params)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["email", "naveen.kewalramani@proptiger.com"], ["password", "q112tp337ru565kh773gs988"], ["LIMIT", 1]]
---
  def login_check
    flash[:notice] = ""
     @user = User.where(email: params[:user][:email], password: UsersHelper.password_convert(params[:user][:password])).first