app/models/url.rb

INSERT INTO "urls" ("longurl", "shorturl", "domain", "suffix") VALUES ($1, $2, $3, $4) RETURNING "id"  [["longurl", "https://stackoverflow.com/lues-for-two-rows-in-the-same-table-in-sql-server"], ["shorturl", "http://pJLB/AAGH"], ["domain", "staflow.com"], ["suffix", "AAGH"]]
---
	def self.CreateLongUrl(url_params)
		@url  = Url.new(url_params)
		@url.suffix= UrlsHelper.suffix(url_params[:longurl],0)
		while Unique(@url.suffix) == false
			@url.suffix = Urls.Helper.suffix(url_params[:longurl],1)
		end
		@url.shorturl = UrlsHelper.domain(url_params[:domain]) + @url.suffix
		if @url.save

SELECT  "urls".* FROM "urls" WHERE "urls"."longurl" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["longurl", "https://stackoverflow.com/questions/2758415/swap-values-for-two-rows-in-the-same-table-in-sql-server"], ["LIMIT", 1]]
---
	def self.FindLong(longurl)
		return Url.where(longurl: longurl).first

SELECT  "urls".* FROM "urls" WHERE "urls"."shorturl" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["shorturl", "http://enTB/KBuF"], ["LIMIT", 1]]
---
	def self.FindShort(shorturl)
		return  Rails.cache.fetch("#{shorturl}", expires_in: 15.minutes) do
				Url.where(shorturl: shorturl).first

SELECT  "urls".* FROM "urls" WHERE "urls"."suffix" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["suffix", "J$&D"], ["LIMIT", 1]]
---
	def self.FindSuffix(suffix)
		return  Rails.cache.fetch("#{suffix}", expires_in: 15.minutes) do
				Url.where(suffix: suffix).first

SELECT  "urls".* FROM "urls" WHERE "urls"."suffix" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["suffix", "AAGH"], ["LIMIT", 1]]
---
	def self.Unique(suffix)
		@check = Url.where(suffix: suffix).first