app/models/url.rb

SELECT  "urls".* FROM "urls" WHERE "urls"."longurl" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["longurl", "https://www.interviewbit.com/?ref=home-page"], ["LIMIT", 1]]
---
	def self.FindLong(longurl) #Search long url in DB
		return Url.where(longurl: longurl).first

SELECT  "urls".* FROM "urls" WHERE "urls"."shorturl" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["shorturl", "www.JLQB/bWqF"], ["LIMIT", 1]]
---
	def self.FindShort(shorturl)
		return  Rails.cache.fetch("#{shorturl}", expires_in: 15.minutes) do
					Url.where(shorturl: shorturl).first

SELECT  "urls".* FROM "urls" WHERE "urls"."suffix" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["suffix", "www.JLQB/bWqF"], ["LIMIT", 1]]
---
	def self.FindSuffix(suffix)
		return  Rails.cache.fetch("#{suffix}", expires_in: 15.minutes) do
					Url.where(suffix: suffix).first