app/models/url.rb

INSERT INTO "urls" ("longurl", "shorturl", "domain", "suffix") VALUES ($1, $2, $3, $4) RETURNING "id"  [["longurl", "https://www.quora.com/Why-are-there-crushed-stones-alongside-rail-tracks"], ["shorturl", "http://hnJ/BbDG"], ["domain", "quora.com"], ["suffix", "BbDG"]]
INSERT INTO "urls" ("longurl", "shorturl", "domain", "suffix") VALUES ($1, $2, $3, $4) RETURNING "id"  [["longurl", "https://felipeelias.github.io/ruby/2017/12/28/elasticsearch-rails-blog.html"], ["shorturl", "http://UwKB/RUCG"], ["domain", "github.com"], ["suffix", "RUCG"]]
---
  def self.create_short_url(url_params)
    url  = Url.new(url_params)
    url.suffix= UrlsHelper.suffix(url_params[:longurl],0)
    while unique(url.suffix) == false
      url.suffix = UrlsHelper.suffix(url_params[:longurl],1)
    end
    url.shorturl = UrlsHelper.domain(url_params[:domain]) + url.suffix
    if url.save

SELECT  "urls".* FROM "urls" WHERE "urls"."longurl" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["longurl", "https://felipeelias.github.io/ruby/2017/12/28/elasticsearch-rails-blog.html"], ["LIMIT", 1]]
---
  def self.find_long(longurl)

SELECT  "urls".* FROM "urls" WHERE "urls"."shorturl" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["shorturl", "http://DkI/8*MB"], ["LIMIT", 1]]
---
  def self.find_short(shorturl)

SELECT  "urls".* FROM "urls" WHERE "urls"."suffix" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["suffix", ""], ["LIMIT", 1]]
---
  def self.find_suffix(suffix)

SELECT  "urls".* FROM "urls" WHERE "urls"."suffix" = $1 ORDER BY "urls"."id" ASC LIMIT $2  [["suffix", "RUCG"], ["LIMIT", 1]]
---
  def self.unique(suffix)
    check = Url.where(suffix: suffix).first