app/models/user.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "ash"], ["email", "ash@gmail.com"], ["password", "b97ui316334155"], ["created_at", "2019-01-28 07:27:13.439037"], ["updated_at", "2019-01-28 07:27:13.439037"]]
---
  def create_user(user_params)
  	@user = User.new(user_params)
    @user.password = UsersHelper.password_convert(user_params[:password])
    if @user.save